In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')
# fetch 1st five rows
df.head(5)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [3]:
df.tail(5)

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [4]:
df.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [5]:
# handling missing values
df.isnull()

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [6]:
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
164    False
165    False
166    False
167    False
168    False
Length: 169, dtype: bool

In [7]:
df.isnull().any

<bound method DataFrame.any of      Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]>

In [8]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [ ]:
df_filled=df.fillna(0)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [10]:
## filling missing values with the mean of column
df['Duration_fillNA']=df['Duration'].fillna(df['Duration'].mean )
df

     Duration  Pulse  Maxpulse  Calories  Duration_fillNA
0          60    110       130     409.1               60
1          60    117       145     479.0               60
2          60    103       135     340.0               60
3          45    109       175     282.4               45
4          45    117       148     406.0               45
..        ...    ...       ...       ...              ...
164        60    105       140     290.8               60
165        60    110       145     300.0               60
166        60    115       145     310.2               60
167        75    120       150     320.4               75
168        75    125       150     330.4               75

[169 rows x 5 columns]

In [11]:
#Renaming Columns
df=df.rename(columns={'Duration':'sale duration'})
df.head()

   sale duration  Pulse  Maxpulse  Calories  Duration_fillNA
0             60    110       130     409.1               60
1             60    117       145     479.0               60
2             60    103       135     340.0               60
3             45    109       175     282.4               45
4             45    117       148     406.0               45

In [13]:
## change datatypes
df['new value']=df['Pulse'].fillna(df['Pulse'].mean()).astype(float)
df.head()

   sale duration  Pulse  Maxpulse  Calories  Duration_fillNA  new value
0             60    110       130     409.1               60      110.0
1             60    117       145     479.0               60      117.0
2             60    103       135     340.0               60      103.0
3             45    109       175     282.4               45      109.0
4             45    117       148     406.0               45      117.0

In [14]:
df['new value']=df['Pulse'].apply(lambda x:x*2)
df.head()

   sale duration  Pulse  Maxpulse  Calories  Duration_fillNA  new value
0             60    110       130     409.1               60        220
1             60    117       145     479.0               60        234
2             60    103       135     340.0               60        206
3             45    109       175     282.4               45        218
4             45    117       148     406.0               45        234

In [15]:
##DATA AGGREGATING AND GROUPING
group_mean=df.groupby('sale duraton')['pule'].mean()
print(group_mean)

KeyError: 'sale duraton'

In [3]:
import pandas as pd

data = {
    'Department': ['IT', 'HR', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 40000, 60000, 45000, 70000],
    'Age': [25, 30, 28, 35, 40]
}

df = pd.DataFrame(data)
df

  Department  Salary  Age
0         IT   50000   25
1         HR   40000   30
2         IT   60000   28
3         HR   45000   35
4    Finance   70000   40

In [4]:
df.groupby('Department').agg({
    'Salary': ['mean', 'max'],
    'Age': 'mean'
})

             Salary          Age
               mean    max  mean
Department
Finance     70000.0  70000  40.0
HR          42500.0  45000  32.5
IT          55000.0  60000  26.5

In [5]:
df.groupby('Department').sum()
df.groupby('Department').count()
df.groupby('Department').min()
df.groupby('Department').max()

            Salary  Age
Department
Finance      70000   40
HR           45000   35
IT           60000   28

In [6]:
df.groupby('Department').sum()

            Salary  Age
Department
Finance      70000   40
HR           85000   65
IT          110000   53

In [7]:
df.groupby('Department').count()

            Salary  Age
Department
Finance          1    1
HR               2    2
IT               2    2